# PipeSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipeSize Property
SpecTypeId Class See Also
---
Pipe Size, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipeSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipeSize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipeSize {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace